import Marketing from './assets/marketing.png'
import Social from './assets/social.png'
import Content from './assets/content.png'
import Translate from './assets/translate.png'
import University from './assets/university.png'
import Business from './assets/business.png'
import Decor from './assets/decor.png'
import Graphic from './assets/graphic.png'
import Ideas from './assets/ideas.png'
import Program from './assets/program.png'
import Records from './assets/records.png'

export const products: Product[] = [
    {
        id: 'marketing',
        name: 'التسويق اللإلكتروني',
        description: 'إذا كنت تريد التسويق الإعلامي الصحيح لمنتجاتك أو شركتك ، سنوفر لك أفضل الإعلانات الترويجية.',
        img: Marketing,
        subOptions: [
            'حملة جوجل إعلانية و دعمها في محركات البحث',
            'خطة تسويقية متكاملة لمشروعك التجاري',
            'إعلانات ممولة على مواقع التواصل الإجتماعي',
            'موشن فيديو لإعلانك التجاري',
            'فيديو ترويجي متكامل (سيناريو - ممثلين - تصوير - مونتاج)',
            'تصميم تطبيق سوق إلكتروني'
        ]
    },
    {
        id: 'social',
        name: 'دعم مواقع التواصل الإجتماعي',
        description: 'هل لديك شغف واهتمام بمواقع التواصل الاجتماعي وتود أن تصبح من المشاهير ..!؟ حسنًا .. تقدم لك شركتنا الدعم للوصول إلى حلمك والحصول على أكبر عدد من الجمهور.',
        img: Social,
        subOptions: [
            'فيسبوك - متابعين للصفحة الشخصية',
            'فيسبوك - معجبين بالصفحات العامة',
            'فيسبوك - أعضاء المجموعات',
            'فيسبوك - الإعجابات على المنشورات',
            'فيسبوك - التعليقات على المنشورات',
            'فيسبوك - المشاهدات على الفيديو',
            'فيسبوك - دعم البث المباشر',
            'فيسبوك - لايف ستريم',
            'يوتيوب - الإشتراكات بالقناة',
            'يوتيوب - المشاهدات على الفيديو',
            'يوتيوب - المشاهدات على الفيديو القصير',
            'يوتيوب - الإعجابات بالفيديو',
            'يوتيوب - لايف ستريم',
            'يوتيوب - التعليقات على الفيديو',
            'انستاجرام - متابعين الصفحة الشخصية',
            'انستاجرام - الإعجابات بالصور',
            'انستاجرام - التعليقات على الصور',
            'انستاجرام - المشاهدات على الفيديو',
            'تيك توك - مشاهدات الفيديو',
            'تيك توك - الإعجابات بالفيديو',
            'تيك توك - متابعة الصفحة',
            'تيك توك - التعليق على الفيديو',
            'تيك توك - لايف ستريم',
        ]
    },
    {
        id: 'content',
        name: 'دعم صانعي المحتوى',
        description: 'هل لديك موهبة وترغب في مشاركتها على وسائل التواصل الاجتماعي بطريقة احترافية؟ سيكون فريق شركتنا بجانبك وسيضمن لك الشهرة والنجاح.',
        img: Content,
        subOptions: [
            
        ]
    },
    {
        id: 'translate',
        name: 'الترجمة',
        description: 'هل لديك مهارات متقدمة في اللغة الإنجليزية؟ حسنًا .. ستقدم لكم شركتنا عروضًا خاصة في مجال الترجمة للحصول على راتب شهري مضمون وكافٍ.',
        img: Translate,
        subOptions: [
            'عربي - انجليزي',
            'عربي - ألماني',
            'عربي - روسي',
            'التدقيق اللغوي',
            'ترجمة و تنقيح البحث العلمي و الأطروحات الجامعية من اللغة العربية إلى اللغة الإنجليزية و بالعكس.',
            'كتابة الترجمة على الفيديو',
        ]
    },
    {
        id: 'university',
        name: 'خدمات جامعية',
        description: 'خدمات و مساعدة في مشاريعك الجامعية',
        img: University,
        subOptions: [
            'المساعدة في تصميم مشاريعك الهندسية',
            'المساعدة في إعداد حلقات البحث من مراجع علمية موثوقة',
            'المساعدة في إعداد و تنقيح الأطروحات الجامعية للتخرج و الماجستير باللغتين العربية و الإنجليزية',
        ]
    },
    {
        id: 'decor',
        name: 'التصميم الهندسي و الديكور',
        description: 'المساعدة في إنشاء التصاميم الهندسية و الديكور',
        img: Decor,
        subOptions: [
            'تصميم شقق سكنية',
            'تصميم فيلات و أبنية',
            'تصميم أبنية تجارية و خدمية (مول - مستشفى - ...)',
            'تصميم ديكور داخلي للشقق السكنية و الشركات و المكاتب',
            'تصميم الواجهات و الإكساءات الخارجية',
        ]
    },
    {
        id: 'program',
        name: 'البرمجة و التصميم',
        description: 'برمجة و تصميم المواقع و التطبيقات',
        img: Program,
        subOptions: [
            'تصميم مواقع ويب',
            'تصميم تطبيق لأجهزة Android',
            'تصميم تطبيق لأجهزة iOS',
            'تصميم تطبيق لأجهزة الكومبيوتر'
        ]
    },
    {
        id: 'records',
        name: 'دبلجة و صوتيات',
        description: 'التسجيلات الصوتية و الدبلجة',
        img: Records,
        subOptions: [
            'تعليق صوتي على الفيديو',
            'الهندسة الصوتية',
            'التوزيع الموسيقي للألحان',
            'تصميم و توزيع الشارات الغنائية للمسلسلات',
            'الموسيقى التصويرية',
            'الدبلجة الصوتية',
        ]
    },
    {
        id: 'graphic',
        name: 'المونتاج و الجرافيك',
        description: 'مونتاج فيديوهات و تصميم جرافيك',
        img: Graphic,
        subOptions: [
            'تصوير و مونتاج الفيديو',
            'موشن فيديو',
            'تصوير شعار',
            'تعديل صور',
            'تصميم صور إعلانية',
            'تصميم هوية بصرية',
            'تصميم صور الغلاف',
        ]
    },
    {
        id: 'business',
        name: 'إدارة الأعمال',
        description: 'لإدارة الأعمال',
        img: Business,
        subOptions: [
            'دراسة جدوى إقتصادية للمشاريع',
            'التحليل الإحصائي',
            'التنظيم الإداري و تأسيس فريق عمل',
            'المحاسبة و الدراسة المالية',
            'إستشارة إدارية و مالية للمشروع',
        ]
    },
    {
        id: 'ideas',
        name: 'دعم المواهب و الأفكار',
        description: 'دعم المواهب و الأفكار',
        img: Ideas,
        subOptions: [
            
        ]
    }
]